Repository: Alaraajavamma/fastflx1
Catalog: po/*.po
Languages: fi

source: Add Location
fi: Lisää sijainti

source: Close
fi: Sulje

source: Enter city name
fi: Kirjoita kaupungin nimi

source: Search
fi: Hae

source: Result
fi: Tulos

source: No location found yet.
fi: Sijaintia ei vielä löytynyt.

source: Searching...
fi: Etsitään...

source: No location found.
fi: Sijaintia ei löytynyt.

source: Error adding location.
fi: Virhe sijainnin lisäämisessä.

source: Tweaks
fi: Säädöt

source: System
fi: Järjestelmä

source: Actions
fi: Toiminnot

source: New Gesture Wizard
fi: Uuden eleen ohjattu toiminto

source: Cancel
fi: Peruuta

source: Go Back
fi: Mene takaisin

source: Proceed
fi: Jatka

source: Step 1: Fingers
fi: Vaihe 1: Sormet

source: How many fingers used for the gesture?
fi: Kuinka monta sormea eleessä käytetään?

source: Step 2: Direction
fi: Vaihe 2: Suunta

source: Which direction is the swipe?
fi: Mihin suuntaan pyyhkäistään?

source: From Left to Right
fi: Vasemmalta oikealle

source: From Right to Left
fi: Oikealta vasemmalle

source: From Top to Bottom
fi: Ylhäältä alas

source: From Bottom to Top
fi: Alhaalta ylös

source: From Bottom-Left to Top-Right
fi: Viistosti vasemmasta alakulmasta kohti oikeaa yläkulmaa

source: From Top-Right to Bottom-Left
fi: Viistosti oikeasta yläkulmasta kohti vasenta alakulmaa

source: From Top-Left to Bottom-Right
fi: Viistosti vasemmasta yläkulmasta kohti oikeaa alakulmaa

source: From Bottom-Right to Top-Left
fi: Viistosti oikeasta alakulmasta kohti vasenta yläkulmaa

source: Step 3: Edge
fi: Vaihe 3: Reuna

source: Where should the gesture start?
fi: Mistä eleen tulisi alkaa?

source: Anywhere
fi: Missä tahansa

source: Left Edge
fi: Vasen reuna

source: Right Edge
fi: Oikea reuna

source: Top Edge
fi: Yläreuna

source: Bottom Edge
fi: Alareuna

source: Top-Left Corner
fi: Vasen yläkulma

source: Top-Right Corner
fi: Oikea yläkulma

source: Bottom-Left Corner
fi: Vasen alakulma

source: Bottom-Right Corner
fi: Oikea alakulma

source: None (Middle of screen only)
fi: Ei mikään (vain ruudun keskellä)

source: Step 4: Distance
fi: Vaihe 4: Etäisyys

source: How long should the swipe be?
fi: Kuinka pitkä pyyhkäisyn tulisi olla?

source: Any Distance
fi: Mikä tahansa etäisyys

source: Short
fi: Lyhyt

source: Medium
fi: Keskipitkä

source: Large
fi: Pitkä

source: Step 5: Mode
fi: Vaihe 5: Tila

source: Trigger on press or release?
fi: Laukaise painettaessa vai vapautettaessa?

source: On Release (Recommended)
fi: Vapautettaessa (Suositus)

source: On Press
fi: Painettaessa

source: Already configured
fi: Jo määritetty

source: Error: Both Release and Press modes are already configured for this gesture combination.
fi: Virhe: Sekä vapautus- että painallustilat on jo määritetty tälle eleyhdistelmälle.

source: Save
fi: Tallenna

source: Select Keyboard
fi: Valitse näppäimistö

source: Edit Item
fi: Muokkaa kohdetta

source: Item Details
fi: Kohteen tiedot

source: Action Name
fi: Toiminnon nimi

source: Action Type
fi: Toiminnon tyyppi

source: Predefined Action
fi: Esivalittu toiminto

source: Select from common actions
fi: Valitse yleisistä toiminnoista

source: Custom Command
fi: Mukautettu komento

source: Execute a shell command
fi: Suorita komentorivikomento

source: Command
fi: Komento

source: Predefined Actions
fi: Esitellyt toiminnot

source: Edit Menu
fi: Muokkaa valikkoa

source: New Item
fi: Uusi kohde

source: Select Action
fi: Valitse toiminto

source: Wofi Menu
fi: Wofi-valikko

source: Show a menu of actions
fi: Näytä toimintovalikko

source: Edit Gesture
fi: Muokkaa elettä

source: General
fi: Yleiset

source: Name
fi: Nimi

source: Trigger Spec
fi: Laukaisimen määritys

source: Not Configured
fi: Ei määritetty

source: Change
fi: Vaihda

source: Locked State
fi: Lukittu tila

source: Edit
fi: Muokkaa

source: Unlocked State
fi: Lukitsematon tila

source: No Action
fi: Ei toimintoa

source: Missing Trigger
fi: Puuttuva laukaisin

source: Please configure a gesture trigger before saving.
fi: Määritä eleen laukaisin ennen tallentamista.

source: Gestures
fi: Eleet

source: Service
fi: Palvelu

source: Enable Touch Gestures
fi: Ota kosketuseleet käyttöön

source: Add New Gesture
fi: Lisää uusi ele

source: Configured Gestures
fi: Määritetyt eleet

source: Unnamed Gesture
fi: Nimetön ele

source: New Gesture
fi: Uusi ele

source: Change Password
fi: Vaihda salasana

source: Password Details
fi: Salasanan tiedot

source: Current Password
fi: Nykyinen salasana

source: New Password
fi: Uusi salasana

source: Confirm New Password
fi: Vahvista uusi salasana

source: Please enter current password.
fi: Anna nykyinen salasana.

source: Please enter new password.
fi: Anna uusi salasana.

source: New passwords do not match.
fi: Uudet salasanat eivät täsmää.

source: Changing password...
fi: Vaihdetaan salasanaa...

source: Password changed successfully!
fi: Salasana vaihdettu onnistuneesti!

source: Failed to change password.
fi: Salasanan vaihto epäonnistui.

source: Authentication error. Check current password.
fi: Tunnistautumisvirhe. Tarkista nykyinen salasana.

source: Bad password.
fi: Huono salasana.

source: it is too short
fi: se on liian lyhyt

source: is the same as the old one
fi: se on sama kuin vanha

source: is a palindrome
fi: se on palindromi

source: case changes only
fi: vain kirjainkoko muuttui

source: is too similar to the old one
fi: se on liian samankaltainen kuin vanha

source: it does not contain enough DIFFERENT characters
fi: siinä ei ole tarpeeksi ERILAISIA merkkejä

source: it is based on a dictionary word
fi: se perustuu sanakirjasanaan

source: Bad password:
fi: Huono salasana:

source: Input Configuration
fi: Syöteasetukset

source: Hardware Buttons
fi: Laitteistopainikkeet

source: Configure short, double, and long press actions
fi: Määritä lyhyen, kaksois- ja pitkän painalluksen toiminnot

source: Touch Gestures
fi: Kosketuseleet

source: Configure edge swipes and shortcuts
fi: Määritä reunapyyhkäisyt ja pikakomennot

source: Buttons
fi: Painikkeet

source: Keyboard
fi: Näppäimistö

source: Active Keyboard
fi: Aktiivinen näppäimistö

source: Change Keyboard
fi: Vaihda näppäimistö

source: Finnish Layout
fi: Suomalainen asettelu

source: Install custom Squeekboard layout
fi: Asenna mukautettu Squeekboard-asettelu

source: Configuration
fi: Asetukset

source: Enforce App Wofi Config
fi: Pakota sovelluksen Wofi-asetukset

source: Use Tweak-FLX1s Wofi style and config
fi: Käytä Tweak-FLX1s Wofi tyyliä ja asetuksia

source: Environment
fi: Ympäristö

source: Current Environment
fi: Nykyinen ympäristö

source: Updates
fi: Päivitykset

source: System Upgrade
fi: Järjestelmäpäivitys

source: Upgrade FuriOS
fi: Päivitä FuriOS

source: Upgrading System
fi: Päivitetään järjestelmä

source: Applications
fi: Sovellukset

source: On-screen keyboard
fi: Virtuaalinäppäimistö

source: Install custom battery monitor
fi: Asenna mukautettu akun seuranta

source: Install
fi: Asenna

source: Alternative Phone and Messages App
fi: Vaihtoehtoinen Puhelin ja Viestit -sovellus

source: Branchy App Store
fi: Branchy-sovelluskauppa

source: Debian Package Installer UI
fi: Debian-pakettien asennusliittymä

source: Security
fi: Tietoturva

source: Enable Shorter Passcodes
fi: Ota käyttöön lyhyemmät salasanat

source: Allow 1-character passwords
fi: Salli 1 merkin salasanat

source: Change current user password
fi: Vaihda nykyisen käyttäjän salasana

source: Fingerprint Authentication
fi: Sormenjälkitunnistus

source: Configure PAM for fingerprint support
fi: Määritä PAM sormenjälkituelle

source: Enable
fi: Ota käyttöön

source: Restarting Keyboard Service
fi: Käynnistetään näppäimistöpalvelu uudelleen

source: Changing Keyboard
fi: Vaihdetaan näppäimistö

source: Remove
fi: Poista

source: Removing Squeekboard
fi: Poistetaan Squeekboard

source: Installing Squeekboard
fi: Asennetaan Squeekboard

source: Enabling Shorter Passwords
fi: Otetaan käyttöön lyhyemmät salasanat

source: Disabling Shorter Passwords
fi: Poistetaan käytöstä lyhyemmät salasanat

source: Removing DebUI
fi: Poistetaan DebUI

source: Installing DebUI
fi: Asennetaan DebUI

source: Removing FLX1s-Bat-Mon
fi: Poistetaan FLX1s-Bat-Mon

source: Installing FLX1s-Bat-Mon
fi: Asennetaan FLX1s-Bat-Mon

source: Fingerprint is enabled
fi: Sormenjälkitunnistus on käytössä

source: Removing Fingerprint
fi: Poistetaan sormenjälkitunnistusta

source: Configuring Fingerprint
fi: Määritetään sormenjälki

source: Installed
fi: Asennettu

source: Removing Phofono
fi: Poistetaan Phofono

source: Installing Phofono
fi: Asennetaan Phofono

source: Removing Branchy
fi: Poistetaan Branchy

source: Installing Branchy
fi: Asennetaan Branchy

source: Switch to Production
fi: Vaihda tuotantoon

source: Production
fi: Tuotanto

source: Switch to Staging
fi: Vaihda stagingiin

source: Switching to Production
fi: Vaihdetaan tuotantoympäristöön

source: Switching to Staging
fi: Vaihdetaan Staging-ympäristöön

source: About Tweak-FLX1s
fi: Tietoja Tweak-FLX1s:stä

source: Version
fi: Versio

source: Developer
fi: Kehittäjä

source: License
fi: Lisenssi

source: Links
fi: Linkit

source: Website
fi: Verkkosivusto

source: Issue Tracker
fi: Ongelmanseuranta

source: Report bugs or request features
fi: Ilmoita virheistä tai ehdota ominaisuuksia

source: Appearance
fi: Ulkoasu

source: GTK3 CSS Tweak
fi: GTK3 CSS -säätö

source: Apply custom UI scaling tweaks for GTK3 apps
fi: Käytä mukautettuja käyttöliittymän skaalaussäätöjä GTK3-sovelluksille

source: Background Services
fi: Taustapalvelut

source: Alarm Volume Fix
fi: Hälytysäänenvoimakkuuden korjaus

source: Ensure alarm plays at full volume
fi: Varmista, että hälytys soi täydellä voimakkuudella

source: Prevent OSK issues
fi: Estä OSK-ongelmat

source: Andromeda Integration
fi: Andromeda-integraatio

source: Shared Folders
fi: Jaetut kansiot

source: Mount ~/.local/share/andromeda to ~/Android-Share
fi: Liitä ~/.local/share/andromeda kansioon ~/Android-Share

source: Custom Sound Theme
fi: Mukautettu ääniteema

source: Use fastflx1 custom sounds
fi: Käytä fastflx1 mukautettuja ääniä

source: Mounting Shared Folders
fi: Liitetään jaetut kansiot

source: Unmounting Shared Folders
fi: Irrotetaan jaetut kansiot

source: Short Press
fi: Lyhyt painallus

source: Double Press
fi: Kaksoispainallus

source: Long Press
fi: Pitkä painallus

source: Use Custom Assistant File
fi: Käytä mukautettua avustajatiedostoa

source: Write ~/.config/assistant-button/...
fi: Kirjoita ~/.config/assistant-button/...

source: Locked Action
fi: Lukittu toiminto

source: Unlocked Action
fi: Lukitsematon toiminto

source: Copy (Ctrl+C)
fi: Kopioi (Ctrl+C)

source: Paste (Ctrl+V)
fi: Liitä (Ctrl+V)

source: Cut (Ctrl+X)
fi: Leikkaa (Ctrl+X)

source: Select All and Copy
fi: Valitse kaikki ja kopioi

source: Paste from Clipboard
fi: Liitä leikepöydältä

source: Kill Active Window
fi: Tapa aktiivinen ikkuna

source: Switch Window on the left
fi: Vaihda ikkunaa vasemmalle

source: Switch Window on the right
fi: Vaihda ikkunaa oikealle

source: Screenshot
fi: Kuvakaappaus

source: Flashlight
fi: Taskulamppu

source: Play/Pause
fi: Toista/Tauko

source: Next Track
fi: Seuraava kappale

source: Previous Track
fi: Edellinen kappale

source: Volume Up
fi: Äänenvoimakkuus ylös

source: Volume Down
fi: Äänenvoimakkuus alas

source: Mute
fi: Mykistä
